package repositories

import (
	"homework-api/models"
)

func GetNews() ([]models.News, error) {
	news1 := models.NewNews(1, "หมอโอภาส ย้ำ WHO ไม่ได้ห้ามผสมสูตรวัคซีน ชี้ ขึ้นกับสถานการณ์แต่ละประเทศ", "วันที่ 14 ก.ค. 2564 นายแพทย์โอภาส การย์กวินพงศ์ อธิบดีกรมควบคุมโรค ตอบคำถามภายหลังแถลงข่าวผลการประชุมคณะกรรมการวัคซีนแห่งชาติ กรณีที่ พล.อ.ประยุทธ์ จันทร์โอชา นายกรัฐมนตรีและรัฐมนตรีว่าการกระทรวงกลาโหม ให้พิจารณาคำเตือนขององค์การอนามัยโลก (WHO)")
	news2 := models.NewNews(2, "เจาะเทรนด์พลังงานทางเลือก และการมาถึงของ \"Future Energy\" ที่พร้อมใช้งานสำหรับคนเมือง", "ผลที่ตามมาจากการที่ประเทศไทยเปิดประตูสู่ยานยนต์ไฟฟ้า คือการเติบโตของแนวคิดการสร้างสังคมที่ยั่งยืนซึ่งทุกคนสามารถมีส่วนร่วมได้ผ่านการขับขี่ยานพาหนะพลังงานทางเลือก ด้วยเหตุดังกล่าว การสนับสนุน “Future Energy” ซึ่งมีทั้งการใช้งานพลังงานหมุนเวียน และการพัฒนาพลังงานไฟฟ้าตั้งแต่ต้นน้ำถึงปลายน้ำ")
	news3 := models.NewNews(3, "จับตา \"โตเกียวโอลิมปิก\" ญี่ปุ่นซ้ำเติมวิกฤติ หรือเป็นต้นแบบจัดงานช่วงโรคระบาด", "นักกีฬาจากหลายประเทศทั่วโลกได้ตบเท้าเดินทางไปยังกรุงโตเกียว ประเทศญี่ปุ่น เพื่อเข้าร่วมการแข่งขันโอลิมปิกฤดูร้อน ที่ญี่ปุ่นเป็นเจ้าภาพในปีนี้ งานที่เกี่ยวข้องกับการแข่งขันได้ถูกจัดเตรียมการเอาไว้ล่วงหน้าเป็นปี หลังจากที่ก่อนหน้านี้โอลิมปิก 2020 ต้องถูกเลื่อนการแข่งขันเพราะการแพร่ระบาดของโรคโควิด-19 ตัวร้าย ที่ทำให้บรรยากาศของโอลิมปิกไม่มีเสียงเชียร์เหมือนอย่างเคย")
	all_news := []models.News{news1, news2, news3}
	return all_news, nil
}
